Revit 2027 API
DuctFittingAndAccessoryPressureDropData.IsCurrentEntityValid Property
 True if the current settings stored in the entity is valid.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCurrentEntityValid { get; set; }
Public Property IsCurrentEntityValid As Boolean
	Get
	Set
public:
property bool IsCurrentEntityValid {
	bool get ();
	void set (bool value);
}
member IsCurrentEntityValid : bool with get, set
Property Value
Boolean
See Also
Reference
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace